# Pandas py practice
Author: Joe Acosta

Date: 07/20/2025

Last day practiced: 07/20/2025

List the imports required to get the titanic dataset and load the dataset

In [1]:
# Imports
import pandas as pd
import seaborn as sns

In [2]:
# Gets the titanic dataset from the sns dataset
titanic = sns.load_dataset('titanic')

Check the data types for the dataset and its columns

In [3]:
# Gets the data type of the titanic dataset to verify if it's pandas dfS
titanic.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [ ]:
# get the series data types

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [4]:
print(type(titanic))

<class 'pandas.core.frame.DataFrame'>

Get the DataFrame information

In [5]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

How many people were on the titanic?

In [6]:
len(titanic)

891

In [7]:
titanic.shape

(891, 15)

What are the different columns?

In [8]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

Get the Top 10 and Bottom 5

In [9]:
titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [10]:
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

Get 5 random passangers

In [11]:
titanic.sample(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
524,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
124,0,1,male,54.0,0,1,77.2875,S,First,man,True,D,Southampton,no,False
379,0,3,male,19.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
720,1,2,female,6.0,0,1,33.0000,S,Second,child,False,NaN,Southampton,yes,False
773,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True

Get Single Passenger

In [12]:
titanic.sample()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
361,0,2,male,29.0,1,0,27.7208,C,Second,man,True,NaN,Cherbourg,no,False

Get the passenger # 342's information

In [14]:
titanic.loc[342]

survived                 0
pclass                   2
sex                   male
age                   28.0
sibsp                    0
parch                    0
fare                  13.0
embarked                 S
class               Second
who                    man
adult_male            True
deck                   NaN
embark_town    Southampton
alive                   no
alone                 True
Name: 342, dtype: object

In [15]:
titanic.iloc[342]

survived                 0
pclass                   2
sex                   male
age                   28.0
sibsp                    0
parch                    0
fare                  13.0
embarked                 S
class               Second
who                    man
adult_male            True
deck                   NaN
embark_town    Southampton
alive                   no
alone                 True
Name: 342, dtype: object

Was Passenger #121 an adult male?

In [16]:
titanic.loc[121].adult_male

np.True_

What was the oldest passengers age?

In [17]:
titanic.age.max()

np.float64(80.0)

Get all statistics for the passenger ages

In [19]:
titanic.age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

What are the ages and sex of passengers 123, 153, and 232

In [20]:
titanic.loc[[123,153,232], ['age', 'sex']]

      age     sex
123  32.5  female
153  40.5    male
232  59.0    male

Order the passengers descending by age and print the results

In [21]:
titanic.sort_values(by='age', ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

Which passenger had an age of 14.5

In [22]:
titanic.loc[titanic.age == 14.5]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
111,0,3,female,14.5,1,0,14.4542,C,Third,child,False,NaN,Cherbourg,no,False

What were all the unique ages of the passengers

In [24]:
titanic.age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

How many different classes did the Titanic have?

In [26]:
titanic['class'].nunique()

3

How many Passengers were in each class?

In [28]:
titanic.groupby('class').size()

C:\Users\Drago\AppData\Local\Temp\ipykernel_27780\1373610074.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby('class').size()

class
First     216
Second    184
Third     491
dtype: int64

In [29]:
titanic['class'].value_counts()

class
Third     491
First     216
Second    184
Name: count, dtype: int64

What are the top 5 ages?

In [31]:
top_age=titanic.age.value_counts().head()
top_age

age
24.0    30
22.0    27
18.0    26
28.0    25
30.0    25
Name: count, dtype: int64

What percent of the passengers are represented by the top 5 ages?

In [32]:
top_age / len(titanic)

age
24.0    0.033670
22.0    0.030303
18.0    0.029181
28.0    0.028058
30.0    0.028058
Name: count, dtype: float64

In [33]:
top_age.sum() / len(titanic)

np.float64(0.14927048260381592)

Who was the youngest first class passenger

In [35]:
titanic.groupby('class').age.min()

C:\Users\Drago\AppData\Local\Temp\ipykernel_27780\2428866404.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby('class').age.min()

class
First     0.92
Second    0.67
Third     0.42
Name: age, dtype: float64

In [36]:
titanic.loc[titanic['class'] == 'First'].age.min()

np.float64(0.92)

What was the average ticket price, the max ticket price, and the min ticket price

In [37]:
titanic.fare.describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: fare, dtype: float64

In [38]:
print(titanic.fare.mean())
print(titanic.fare.max())
print(titanic.fare.min())

32.204207968574636
512.3292
0.0

How many passengers didn't pay for a ticket?

In [39]:
(titanic.fare == 0).sum()

np.int64(15)

Assign the ticket prices high, mid, low for revenue. The category delimiters are the 1/3rd percentile and 2/3rd percentile

USE A FUNCTION

In [41]:
# Function that assigns the quartiles
low=titanic.fare.quantile(1/3)
high=titanic.fare.quantile(2/3)

def cost_cat(fare) :
    if fare < low :
        return 'Low'
    elif fare < high :
        return 'Med'
    else :
        return 'High'

In [44]:
fare_cat=titanic.fare.apply(cost_cat)
fare_cat

0       Low
1      High
2       Low
3      High
4       Low
       ...
886     Med
887    High
888     Med
889    High
890     Low
Name: fare, Length: 891, dtype: object

Get the counts given the fare categories

In [45]:
fare_cat.value_counts()

fare
High    326
Low     295
Med     270
Name: count, dtype: int64

Who was more likely to die, people traveling alone or people traveling with others

In [47]:
# Checked missing data
# titanic.alone.unique()
# titanic.survived.unique()

In [54]:
titanic.groupby('alone')['survived'].size()

alone
False    354
True     537
Name: survived, dtype: int64

In [49]:
titanic.groupby('alone')['survived'].mean()

alone
False    0.505650
True     0.303538
Name: survived, dtype: float64

In [ ]:
titanic.groupby('alone').get_group(True)

of the five people with the most expensive tickets, how many survived, what class were they in, and how much did they pay?

In [62]:
highest_exp=titanic.sort_values(by='fare', ascending=False).head()
highest_exp[['survived', 'class', 'fare']]

     survived  class      fare
679         1  First  512.3292
258         1  First  512.3292
737         1  First  512.3292
88          1  First  263.0000
438         0  First  263.0000

What's the total cost of all passenger tickets

In [63]:
titanic.fare.sum()

np.float64(28693.9493)

The oldest passenger was 80, what class did they belong to

In [64]:
titanic.loc[titanic.age==titanic.age.max(), 'class']

630    First
Name: class, dtype: category
Categories (3, object): ['First', 'Second', 'Third']

What was the oldest passengers ID?

In [65]:
titanic.age.idxmax()

630

Create a series for ticket price with a name

In [68]:
fares=pd.Series(titanic.fare, name='Ticket Prices')
fares

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Ticket Prices, Length: 891, dtype: float64

What is the data type for the series ticket price?

In [69]:
fares.dtype

dtype('float64')

How Many people in each class survived and what percentages in each class survived?

In [72]:
titanic.groupby('class').survived.mean()

C:\Users\Drago\AppData\Local\Temp\ipykernel_27780\3166308020.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby('class').survived.mean()

class
First     0.629630
Second    0.472826
Third     0.242363
Name: survived, dtype: float64